import { useState, useEffect } from 'react';

const useMsgTip = () => {
    let msgtips = [
        '138****4256抽中了二等奖',
        '131****4308中了幸运奖',
        '131****4489中了幸运奖',
        '139****4763抽中了三等奖',
        '138****4771抽中了二等奖',
        '159****5101抽中了三等奖',
        '159****5244抽中了二等奖',
        '159****5300抽中了二等奖',
        '139****5383中了三等奖',
        '159****5407抽中了三等奖',
        '177****5505抽中了三等奖',
        '177****5595抽中了三等奖',
        '131****5717抽中了幸运奖',
        '139****6020抽中了幸运奖',
        '177****6282抽中了三等奖',
        '139****6321中了三等奖',
        '177****6329抽中了三等奖',
        '177****6382抽中了三等奖',
        '131****6398抽中了幸运奖',
        '138****6442抽中了二等奖',
        '159****6458抽中了三等奖',
        '133****6552抽中了一等奖',
        '131****6589中了幸运奖',
        '136****6628抽中了特等奖',
        '159****6710抽中了二等奖',
        '133****6778抽中了一等奖',
        '159****6924抽中了二等奖',
        '136****7072抽中了一等奖',
        '133****7108抽中了一等奖',
        '177****7230抽中了三等奖',
        '131****7237抽中了幸运奖',
        '177****7388中了三等奖',
        '138****7497抽中了二等奖',
        '159****7609抽中了二等奖',
        '138****7696抽中了一等奖',
        '159****7863中了三等奖',
        '138****7903抽中了一等奖',
        '139****7951抽中了三等奖',
        '159****7982抽中了二等奖',
        '133****8026抽中了一等奖',
        '136****8182抽中了一等奖',
        '138****8304抽中了二等奖',
        '131****8363抽中了幸运奖',
        '159****8396抽中了二等奖',
        '131****8399抽中了幸运奖',
        '159****8801抽中了二等奖',
        '139****8897抽中了幸运奖',
        '139****8999抽中了幸运奖',
        '159****9079抽中了三等奖',
        '177****9227抽中了三等奖'
    ];
    const [msgtip, setMsgtip] = useState({ text: msgtips[0], key: 0 });
    useEffect(() => {
        let nextKey = msgtip.key == msgtips.length - 1 ? 0 : msgtip.key + 1;
        let timer = setTimeout(() => {
            setMsgtip({ text: msgtips[nextKey], key: nextKey });
        }, 2000);
        return function() {
            clearTimeout(timer);
        };
    }, [msgtip]);

    return msgtip;
};
module.exports = useMsgTip;
